app/views/projects/show.html.erb

        <div class="container">
          <h3 class="sub-heading-text"style="margin-left: 15px; margin-bottom: 20px;">Project Lead: <%=@project.user.first_name%> <%=@project.user.last_name%></h3>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]