app/controllers/posts_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("content", "user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "fasdfasdfas"], ["user_id", 2], ["project_id", 1], ["created_at", "2023-03-16 14:14:14.832609"], ["updated_at", "2023-03-16 14:14:14.832609"]]
---
  def create
    @project = Project.find(params[:project_id])
    @post = Post.new(post_params)
    @post.user = current_user
    @post.project = @project
    if @post.save