app/controllers/projects_controller.rb

INSERT INTO "projects" ("start_date", "end_date", "title", "status", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @project = Project.new(project_params)
    @project.user = current_user
    if @project.save